Table of Contents
 Class Conversion
Namespace
IdeaStatiCa.PluginsTools.CrossSectionConversions
Assembly
IdeaStatiCa.Plugin.dll
public abstract class Conversion
Inheritance
object
Conversion
Derived
CustomConversion
RegexReplace
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 Conversion(string)
protected Conversion(string pattern)
Parameters
pattern string
Properties
 MatchRegex
protected Regex MatchRegex { get; }
Property Value
Regex
Methods
 Convert(string)
public abstract string Convert(string text)
Parameters
text string
Returns
string
 IsMatch(string)
public bool IsMatch(string txt)
Parameters
txt string
Returns
bool
 Edit this page